# -*- coding:utf-8 -*-
import os
import sys
import random

import django

#引入django，可以使用django的方法和函数等
BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
sys.path.insert(0,BASE_DIR)
#sys.path.append(BASE_DIR)
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "ztc.settings")
django.setup()


from MdfMine.models import  User



firstname = [
        '赵','钱','孙','李','周','吴','郑','王',
        '冯','陈','褚','卫','蒋','沈','韩','杨',
        '朱','秦','尤','许','何','吕','施','张',
        '孔','曹','严','华','金','魏','陶','姜',
        '戚','谢','邹','喻','柏','水','窦','章',
        '云','苏','潘','葛','奚','范','彭','郎',
        '鲁','韦','昌','马','苗','凤','花','方',
        '俞','任','袁','柳','酆','鲍','史','唐',
        '费','廉','岑','薛','雷','贺','倪','汤',
]

lastname = {'男':['安邦','安福','安歌','安国','安和','安康','安澜','安民','安宁','安平','安然','安顺','安翔','安晏','安宜','安怡','安易','安志','昂然','昂雄','宾白','宾鸿','宾实','彬彬','彬炳','彬郁','斌斌','斌蔚','滨海','波光','波鸿','波峻',' 波涛','博瀚','博超','博达','博厚','博简','博明','博容','博赡','博涉','博实','博涛',' 博文','博学','博雅','博延','博艺','博易','博裕','博远','飞鸾','飞鸣','飞鹏','飞扬','峻熙','弘文','睿渊','楷瑞','嘉懿','煜城','懿轩','烨伟','苑博','伟泽','熠彤','飞文','修洁','黎昕','明轩','健柏','鸿煊','博涛','烨霖','烨华','煜祺','智宸','正豪','昊然','明杰','立诚','立轩','立辉','熠彤','鸿煊','烨霖','哲瀚','鑫鹏','致远','俊驰','雨泽','烨磊','晟睿','天佑','文昊','远航','旭尧','鸿涛','伟祺','荣轩','越泽','浩宇','瑾瑜','皓轩','擎苍','擎宇','志泽','子轩','弘文','哲瀚','雨泽','鑫磊','修杰','伟诚','建辉','晋鹏','天磊','绍辉','泽洋','鹏煊','昊强','伟宸','博超','君浩','子骞','明辉','鹏涛','炎彬','鹤轩','越彬','风华','靖琪','明诚','高格','光华','国源','冠宇','晗昱','涵润','翰飞','翰海','昊乾','浩博','和安','弘博','宏恺','鸿朗','才捷','才良','才艺','才英','才哲','才俊','成和','成弘','成化','成济','成礼','成龙','成仁','成双','成天','成文','成业','成益','成荫','成周','承安','承弼','承德','承恩','承福','承基','承教','承平','承嗣','承天','承望','承宣','承颜','承业','承悦','承允','承运','承载','承泽','承志','德本','德海','德厚','德华','德辉','德元','德运','德庸'],
            '女':['梦琪','忆柳','之桃','慕青','问兰','尔岚','初夏','沛菡','傲珊','曼文','乐菱','痴珊','恨玉','惜文''香寒','语蓉','海安','夜蓉','涵柏','水桃','醉蓝','春儿','语琴''从彤','语兰','又菱','碧彤','元霜','怜梦','紫寒','妙彤','曼易''南莲','雨寒','易烟','如萱','若南','寻真','晓亦','向珊','慕灵''以蕊','映易','雪柳','孤岚','笑霜','海云','凝天','沛珊','寒云''冰旋','绿真','盼儿','晓霜','碧凡','夏菡','曼香','若烟','半梦''雅绿','灵槐','平安','书翠','翠风','香巧','代云','梦曼','幼翠''友巧','梦柏','醉易','访旋','亦玉','凌萱','访卉','怀亦','笑蓝''春翠','夜蕾','冰夏','梦松','书雪','乐枫','念薇','靖雁','寻春''恨山','忆香','觅波','静曼','凡旋','以亦','念露','芷蕾','千兰''新波','新蕾','雁玉','冷卉','紫山','千琴','恨天','傲芙','盼山''怀蝶','山柏','翠萱','恨松','问旋','从南','白易','问筠','如霜''半芹','冰彤','亦寒','寒雁','怜云','寻文','乐丹','翠柔','谷山''之瑶','谷丝','秋翠','白晴','海露','代荷','书蕾','听白','访琴','秋春','雪青','乐瑶','含烟','涵双','雅蕊','傲之','灵薇','含蕾','从梦','从蓉','初丹','听兰','语芙','夏彤','凌瑶','幼旋','尔蓝','沛山','代丝','痴梅','觅松','冰香','依玉','冰之','妙梦','以冬','碧春','冷菱','雪曼','安白','香桃','安春','千亦','凌蝶','又夏','南烟','靖易','沛凝','翠梅','雪卉','乐儿','傲丝','安青','初蝶','寄灵','惜寒','雨竹','冬莲','绮南','翠柏','平凡','孤兰','秋珊','新筠','半芹','夏瑶','念文','晓丝','涵蕾','雁凡','谷兰','灵凡','凝云','丹肜','南霜','夜梦']
            }

provices = ["北京","上海","深圳","郑州","西安","成都","沈阳"]
citys = ["北京","上海","深圳","郑州","西安","成都","沈阳"]

sexs = ['男','女']

def join_name():
    fn = random.choice(firstname)
    sex = random.choice(sexs)
    ln = random.choice(lastname[sex])
    return ''.join([str(fn),str(ln)]),sex

def add_rebort(n):
    for phonenum in range(n) :
        name,sex = join_name()
        print(name)
        User.objects.create(
            phonenum= random.randint(20000000001,29999999999),
            nickname= name,
            sex= sex,
            birth_year= random.randint(1990,2000),
            birth_month= random.randint(1, 12),
            birth_day= random.randint(1, 28),
            loc_provice= random.choice(provices),
            loc_city=random.choice(citys)
    )


add_rebort(100000)